test/multiphase/multiphaseEuler/thermal/waterEvaporation/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    thermalPhaseChangeMultiphaseSystem;

phases (steam water);

phaseChange on;

steam
{
    type            purePhaseModel;
    diameterModel   none;
    residualAlpha   1e-6;
    Sct             0.7;
}

water
{
    type            purePhaseModel;
    diameterModel   constant;
    d               5e-4;
    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            continuous;
        phase           steam;
    }
}

surfaceTension
{
    steam_water
    {
        type            constant;
        sigma           0.07;
    }
}

saturationTemperature
{
    steam_water
    {
        type            constant;
        value           372.76;
    }
}

drag
{}

virtualMass
{}

heatTransfer
{
    water_dispersedIn_steam_inThe_steam
    {
        type RanzMarshall;
        residualAlpha 1e-4;
    }

    water_dispersedIn_steam_inThe_water
    {
        type spherical;
        residualAlpha 1e-4;
    }
}

phaseTransfer
{}

lift
{}

wallLubrication
{}

turbulentDispersion
{}

// ************************************************************************* //
